# Challenge

Another approach to identifying fraudulent transactions is to look for outliers in the data. Standard deviation or quartiles are often used to detect outliers. Using this starter notebook, code two Python functions:

* One that uses standard deviation to identify anomalies for any cardholder.

* Another that uses interquartile range to identify anomalies for any cardholder.

## Identifying Outliers using Standard Deviation

In [1]:
# Initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [2]:
# Create a connection to the database
engine = create_engine("postgresql://postgres:Prerna4@localhost:5432/fraud_detection")

In [3]:
# Write function that locates outliers using standard deviation
def outliersdetection(data):
    outliers = []
    threshold = 3
    mean_o = np.mean(data)
    std_o = np.std(data)
    
    for i in data:
        z_score = (i - mean_o)/std_o
        if np.abs(z_score)>threshold:
            outliers.append(i)
    return outliers

In [4]:
query = ''' 
SELECT  ch.id, tr.date, tr.amount, tr.card, tr.id_merchant, mc.name

FROM card_holder ch

JOIN credit_card cc

ON ch.id = cc.cardholder_id

JOIN transaction tr

ON tr.card = cc.card

JOIN merchant me

ON tr.id_merchant = me.id_merchant_category

JOIN merchant_category mc

ON tr.id_merchant = mc.id

'''

In [5]:
data = pd.read_sql(query, engine)

data.head()

,id,date,amount,card,id_merchant,name
0,11,2018-12-03 14:27:49-05:00,11.88,4027907156459098,1,restaurant
1,2,2018-10-30 07:27:12-04:00,10.45,675911140852,1,restaurant
2,16,2018-10-28 19:39:18-04:00,12.39,503842928916,1,restaurant
3,21,2018-10-06 18:18:03-04:00,20.69,4279104135293225293,1,restaurant
4,1,2018-09-23 22:15:58-04:00,10.32,3517111172421930,1,restaurant

In [6]:
# Find anomalous transactions for 3 random card holders
ran_holder_1 = data.loc[data['id']== random.choice(data['id'])]
ran_holder_2 = data.loc[data['id']== random.choice(data['id'])]
ran_holder_3 = data.loc[data['id']== random.choice(data['id'])]

In [7]:
ran_holder_1.head()

     id                       date  amount             card  id_merchant name
73   25  2018-07-13 06:19:18-04:00    1.56  372414832802279            3  bar
96   25  2018-08-07 19:29:41-04:00   10.15  372414832802279            4  pub
97   25  2018-07-31 20:15:39-04:00   20.73  372414832802279            4  pub
134  25  2018-08-07 19:29:41-04:00   10.15  372414832802279            4  pub
135  25  2018-07-31 20:15:39-04:00   20.73  372414832802279            4  pub

In [8]:
ran_holder_2.head()

,id,date,amount,card,id_merchant,name
2,16,2018-10-28 19:39:18-04:00,12.39,503842928916,1,restaurant
16,16,2018-10-28 19:39:18-04:00,12.39,503842928916,1,restaurant
29,16,2018-12-26 13:25:09-05:00,17.09,503842928916,2,coffee shop
31,16,2018-12-08 21:51:40-05:00,16.18,5570600642865857,2,coffee shop
32,16,2018-11-30 09:08:26-05:00,1.53,503842928916,2,coffee shop

In [9]:
ran_holder_3.head()

,id,date,amount,card,id_merchant,name
4,1,2018-09-23 22:15:58-04:00,10.32,3517111172421930,1,restaurant
18,1,2018-09-23 22:15:58-04:00,10.32,3517111172421930,1,restaurant
42,1,2018-08-17 05:25:32-04:00,10.21,4761049645711555811,2,coffee shop
54,1,2018-03-10 23:00:35-05:00,0.76,3517111172421930,2,coffee shop
79,1,2018-03-30 17:01:55-04:00,10.58,4761049645711555811,3,bar

## Identifying Outliers Using Interquartile Range

In [10]:
# Write a function that locates outliers using interquartile range
def outliers_iqr(data):
    sorted(data)
    q1,q3 = np.percentile(data,[25,75])
    iqr = q3-q1
    l_bound = q1-(1.5 * iqr)
    u_bound = q3+(1.5 * iqr)
    
    for i in data:
        u_bound_data = []
        l_bound_data = []
        
        if i > u_bound:
            u_bound_data.append(i)
        elif i < l_bound:
            l_bound_data.append(i)
    return u_bound_data, l_bound_data

In [11]:
# Find anomalous transactions for 3 random card holders

ran_holder_4 = data.loc[data['id']== random.choice(data['id'])]
ran_holder_5 = data.loc[data['id']== random.choice(data['id'])]
ran_holder_6 = data.loc[data['id']== random.choice(data['id'])]

In [12]:
ran_holder_4.head()

,id,date,amount,card,id_merchant,name
2,16,2018-10-28 19:39:18-04:00,12.39,503842928916,1,restaurant
16,16,2018-10-28 19:39:18-04:00,12.39,503842928916,1,restaurant
29,16,2018-12-26 13:25:09-05:00,17.09,503842928916,2,coffee shop
31,16,2018-12-08 21:51:40-05:00,16.18,5570600642865857,2,coffee shop
32,16,2018-11-30 09:08:26-05:00,1.53,503842928916,2,coffee shop

In [13]:
ran_holder_5.head()

,id,date,amount,card,id_merchant,name
12,7,2018-02-13 01:31:17-05:00,2.19,4539990688484983,1,restaurant
26,7,2018-02-13 01:31:17-05:00,2.19,4539990688484983,1,restaurant
39,7,2018-10-07 20:28:59-04:00,1.01,3516952396080247,2,coffee shop
56,7,2018-02-28 09:00:15-05:00,6.16,4539990688484983,2,coffee shop
69,7,2018-10-19 09:27:44-04:00,4.30,3516952396080247,3,bar

In [14]:
ran_holder_6.head()

,id,date,amount,card,id_merchant,name
0,11,2018-12-03 14:27:49-05:00,11.88,4027907156459098,1,restaurant
9,11,2018-05-09 15:20:49-04:00,4.09,180098539019105,1,restaurant
13,11,2018-02-05 08:37:24-05:00,17.85,180098539019105,1,restaurant
14,11,2018-12-03 14:27:49-05:00,11.88,4027907156459098,1,restaurant
23,11,2018-05-09 15:20:49-04:00,4.09,180098539019105,1,restaurant